app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aaa"], ["body", "aaa"], ["updated_at", "2020-10-11 04:41:09.862708"], ["id", 9]]
SELECT "books".* FROM "books"
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
     flash[:notice] = "Book was successfully updated."
     redirect_to book_path(@book.id)
    else
     @books = Book.all

INSERT INTO "books" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2020-10-11 08:16:43.535017"], ["updated_at", "2020-10-11 08:16:43.535017"], ["title", "リーダブルコード"], ["body", "より良いコードを書くためのシンプルで実践的なテクニック"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all